{% for src in design.rtl.sources %}
{%- if src.type == 'verilog' %}
read_verilog -noautowire {%- if src.variant == 'systemverilog' %} -sv {% endif %} {{src}}
{%- endif %}
{%- endfor %}

prep -top {{design.rtl.top}}
hierarchy -check -simcheck -top {{design.rtl.top}}
opt
check {{" ".join(opts.rtl_check)}} -assert
write_json yosys_rtl.json

{{synth_command}} {{" ".join(opts.synth)}} -top {{design.rtl.top}}

write_json netlist.json